---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarHandleNameData
source: html/0ea9f53a-2adc-cbd6-9084-c67bb004e4a7.htm
---
# Autodesk.Revit.DB.Structure.RebarHandleNameData

This class is used to contain the information about the rebar handle name defined by an external application.

## Syntax (C#)
```csharp
public class RebarHandleNameData : IDisposable
```